<?php

return array
(
    'noempty'    => 'Поле ":field:" не может быть пустым',
    'number'     => 'Поле ":field:" не является целым числом',
    'decimal'    => 'Поле ":field:" не является десятичным числом',
    'alpha'      => 'Поле ":field:" может содержать только алфавитные символы',
    'alpha_ext'  => 'Поле ":field:" может содержать только расширенный набор алфавитных символов',
    'email'      => 'Поле ":field:" не является почтой',
    'phone'      => 'Поле ":field:" не является целым числом',
    'url'        => 'Поле ":field:" не является url',
    'length'     => 'Поле ":field:" не может содержать не :param2: символов',
    'min_lehgth' => 'Поле ":field:" не может содержать меньше :param2: символов',
    'max_length' => 'Поле ":field:" не может содержать больше :param2: символов',
);