<?php

return array
(
	'noempty'     => 'Поле %s не может быть пустым',
	'number'      => 'Поле %s не является целым числом',
	'decimal'     => 'Поле %s не является десятичным числом',
	'alpha'       => 'Поле %s не является десятичным числом',
	'alpha_ext'   => 'Поле %s не является десятичным числом',
	'email'       => 'Поле %s не является почтой',
	'phone'       => 'Поле %s не является целым числом',
	'url'         => 'Поле %s не является url',
	'length'      => 'Поле %s не может содержать не %s символов',
	'min_lehgth'  => 'Поле %s не может содержать меньше %s символов',
	'max_length'  => 'Поле %s не может содержать больше %s символов',
	'equal_field' => 'Поле %s должно быть идентичным полю %s',
);